In [3]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series(np.arange(5),index = np.arange(5)[::-1],dtype='int64')
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [5]:
s.isin([1,3,4])

4    False
3     True
2    False
1     True
0     True
dtype: bool

In [6]:
s[s.isin([1,3,4])]

3    1
1    3
0    4
dtype: int64

In [7]:
s2 = pd.Series(np.arange(6),index = pd.MultiIndex.from_product([[0,1],['a','b','c']]))
s2

0  a    0
   b    1
   c    2
1  a    3
   b    4
   c    5
dtype: int32

In [10]:
s2.iloc[s2.index.isin([(1,'a'),(0,'b')])]

0  b    1
1  a    3
dtype: int32

In [11]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [12]:
s[s>2]

1    3
0    4
dtype: int64

In [16]:
dates = pd.date_range('20171124',periods=8)

In [17]:
df = pd.DataFrame(np.random.randn(8,4),index=dates,columns=['A','B','C','D'])

In [18]:
df

                   A         B         C         D
2017-11-24 -1.690231 -0.338101 -1.071022  1.084637
2017-11-25  1.292291  0.449885  0.468264  0.637102
2017-11-26  0.602494 -0.591658  0.301893 -1.050524
2017-11-27 -1.132170  1.310110  0.552812  0.370947
2017-11-28 -0.113234 -0.859983  0.381977  0.371730
2017-11-29  0.616029  0.209225  1.879964  0.179152
2017-11-30  0.554969 -0.656240  2.449274 -0.302113
2017-12-01  0.700342  1.068990 -0.572698  0.577581

In [19]:
df.select(lambda x:x=='A',axis='columns')

                   A
2017-11-24 -1.690231
2017-11-25  1.292291
2017-11-26  0.602494
2017-11-27 -1.132170
2017-11-28 -0.113234
2017-11-29  0.616029
2017-11-30  0.554969
2017-12-01  0.700342

In [20]:
df.where(df < 0)

                   A         B         C         D
2017-11-24 -1.690231 -0.338101 -1.071022       NaN
2017-11-25       NaN       NaN       NaN       NaN
2017-11-26       NaN -0.591658       NaN -1.050524
2017-11-27 -1.132170       NaN       NaN       NaN
2017-11-28 -0.113234 -0.859983       NaN       NaN
2017-11-29       NaN       NaN       NaN       NaN
2017-11-30       NaN -0.656240       NaN -0.302113
2017-12-01       NaN       NaN -0.572698       NaN

In [21]:
df.where(df < 0,-df)

                   A         B         C         D
2017-11-24 -1.690231 -0.338101 -1.071022 -1.084637
2017-11-25 -1.292291 -0.449885 -0.468264 -0.637102
2017-11-26 -0.602494 -0.591658 -0.301893 -1.050524
2017-11-27 -1.132170 -1.310110 -0.552812 -0.370947
2017-11-28 -0.113234 -0.859983 -0.381977 -0.371730
2017-11-29 -0.616029 -0.209225 -1.879964 -0.179152
2017-11-30 -0.554969 -0.656240 -2.449274 -0.302113
2017-12-01 -0.700342 -1.068990 -0.572698 -0.577581

In [22]:
df.where(df < 0,999)

                     A           B           C           D
2017-11-24   -1.690231   -0.338101   -1.071022  999.000000
2017-11-25  999.000000  999.000000  999.000000  999.000000
2017-11-26  999.000000   -0.591658  999.000000   -1.050524
2017-11-27   -1.132170  999.000000  999.000000  999.000000
2017-11-28   -0.113234   -0.859983  999.000000  999.000000
2017-11-29  999.000000  999.000000  999.000000  999.000000
2017-11-30  999.000000   -0.656240  999.000000   -0.302113
2017-12-01  999.000000  999.000000   -0.572698  999.000000

In [23]:
df = pd.DataFrame(np.random.rand(10,3),columns = list('abc'))
df

          a         b         c
0  0.760971  0.910097  0.480540
1  0.242792  0.778342  0.852441
2  0.147953  0.449719  0.539780
3  0.519164  0.936192  0.402399
4  0.365343  0.148621  0.176917
5  0.837852  0.283028  0.527734
6  0.729312  0.066871  0.747968
7  0.502851  0.462246  0.116735
8  0.472404  0.517753  0.945877
9  0.962282  0.300276  0.258252

In [24]:
df.query('(a<b)')

          a         b         c
0  0.760971  0.910097  0.480540
1  0.242792  0.778342  0.852441
2  0.147953  0.449719  0.539780
3  0.519164  0.936192  0.402399
8  0.472404  0.517753  0.945877

In [25]:
df.query('(a<b) & (b<c)')

          a         b         c
1  0.242792  0.778342  0.852441
2  0.147953  0.449719  0.539780
8  0.472404  0.517753  0.945877